Repository: Mahdiware/hifdh
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Hifdh
ar: الحفظ

source: Dashboard
ar: لوحة القيادة

source: Plans
ar: الخطط

source: History
ar: السجل

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: System Theme
ar: مظهر النظام

source: Light Theme
ar: فاتح

source: Dark Theme
ar: داكن

source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة

source: Create Backup
ar: إنشاء نسخة احتياطية

source: Restore Backup
ar: استعادة نسخة احتياطية

source: Reset Data
ar: إعادة تعيين البيانات

# resetDataConfirmation
source: Reset All Data?
ar: إعادة تعيين جميع البيانات؟

# resetDataWarning
source: This will delete all your tasks, notes, and progress history. This action cannot be undone.
ar: سيؤدي هذا إلى حذف جميع مهامك وملاحظاتك وسجل التقدم. لا يمكن التراجع عن هذا الإجراء.

source: Cancel
ar: إلغاء

source: Reset Everything
ar: مسح كل شيء

# dataResetSuccess
source: All data has been reset.
ar: تمت إعادة تعيين جميع البيانات.

# backupCreated
source: Backup created successfully
ar: تم إنشاء النسخة الاحتياطية بنجاح

# backupRestored
source: Backup restored successfully
ar: تم استعادة النسخة الاحتياطية بنجاح

source: Quiz Setup
ar: إعداد الاختبار

source: Progress
ar: التقدم

source: Quiz
ar: اختبار

source: Active Tasks
ar: المهام النشطة

source: No active tasks.
ar: لا توجد مهام نشطة.

source: Pending
ar: قيد الانتظار

source: In Progress
ar: جاري التنفيذ

source: Unknown
ar: غير معروف

source: Start
ar: بدء

source: Complete
ar: إكمال

source: Done
ar: تم

source: Memorize
ar: حفظ

source: Revision
ar: مراجعة

source: Notes
ar: ملاحظات

source: Create New Plan
ar: إنشاء خطة جديدة

source: Target Date
ar: تاريخ الهدف

source: Select Date
ar: اختر التاريخ

source: Surah
ar: سورة

source: Juz
ar: جزء

source: Page
ar: صفحة

source: Start Ayah
ar: آية البداية

source: End Ayah
ar: آية النهاية

source: Start Page
ar: صفحة البداية

source: End Page
ar: صفحة النهاية

source: Assign Task
ar: تعيين المهمة

# pleaseSelectSurah
source: Please select a Surah
ar: يرجى اختيار سورة

# pleaseSelectJuz
source: Please select a Juz
ar: يرجى اختيار جزء

# pleaseSelectPageRange
source: Please enter valid page range
ar: يرجى إدخال نطاق صفحات صالح

source: Select/Search Ayah...
ar: اختر/ابحث عن آية...

source: Unknown Ayah
ar: آية غير معروفة

source: Description (Optional)...
ar: الوصف (اختياري)...

# pleaseSelectAyah
source: Please select an Ayah
ar: يرجى اختيار آية

source: No notes yet
ar: لا توجد ملاحظات بعد

source: Note
ar: ملاحظة

source: Doubt
ar: شك

source: Mistake
ar: خطأ

source: Search History...
ar: بحث في السجل...

# sortNewest
source: Newest First
ar: الأحدث أولاً

# sortOldest
source: Oldest First
ar: الأقدم أولاً

# noHistory
source: No history available
ar: لا يوجد سجل متاح

source: Overview
ar: نظرة عامة

source: Stats
ar: إحصائيات

source: Memorized
ar: تم الحفظ

source: Remaining
ar: متبقي

source: Memorize Tasks First
ar: مهام الحفظ أولاً

source: Revision Tasks First
ar: مهام المراجعة أولاً

source: Today
ar: اليوم

source: Yesterday
ar: أمس

source: No notes recorded
ar: لا توجد ملاحظات مسجلة

source: Select Surah
ar: اختر السورة

source: Select Juz
ar: اختر الجزء

source: Subdivision
ar: التقسيم الفرعي

source: Full Juz
ar: جزء كامل

source: Hizb
ar: حزب

source: Whole Juz
ar: جزء كامل

source: Nisf Hizb
ar: نصف حزب

source: Rubuc
ar: ربع

source: Select Deadline
ar: حدد الموعد النهائي

source: Create Plan
ar: إنشاء خطة

# planCreatedSuccess
source: Plan Created Successfully!
ar: تم إنشاء الخطة بنجاح!

# pleaseSelectDeadline
source: Please select a deadline
ar: يرجى تحديد موعد نهائي

# startAyahErrorRange
source: Start Ayah must be between 1 and {max}
ar: يجب أن تكون آية البداية بين 1 و {max}

# endAyahErrorRange
source: End Ayah must be between 1 and {max}
ar: يجب أن تكون آية النهاية بين 1 و {max}

# startAyahErrorOrder
source: Start Ayah cannot be after End Ayah
ar: لا يمكن أن تكون آية البداية بعد آية النهاية

source: Please enter valid pages
ar: يرجى إدخال صفحات صالحة

# contentMemorizedSwitch
source: Content is already memorized. Switched to Revision.
ar: المحتوى محفوظ بالفعل. تم التبديل إلى المراجعة.

# contentNotMemorizedSwitch
source: Content is not yet memorized. Switched to Memorize.
ar: المحتوى غير محفوظ بعد. تم التبديل إلى الحفظ.

source: No Surahs loaded
ar: لم يتم تحميل السور

# revisionsShort
source: Revs
ar: مراجعات

source: View Juz History & Notes
ar: عرض سجل وملاحظات الجزء

source: Surah Task
ar: مهمة سورة

source: Juz Task
ar: مهمة جزء

# activeTaskSingle
source: Active Task
ar: مهمة نشطة

source: Covered by Juz
ar: مغطى بواسطة الجزء

# percentMemorized
source: {pct}% Memorized
ar: {pct}% تم الحفظ

source: Activity
ar: النشاط

source: Hifdh Performance
ar: أداء الحفظ

# days7
source: 7 Days
ar: 7 أيام

# days30
source: 30 Days
ar: 30 يوماً

# months3
source: 3 Months
ar: 3 أشهر

# months6
source: 6 Months
ar: 6 أشهر

# year1
source: 1 Year
ar: سنة واحدة

# noActivityPeriod
source: No activity in this period
ar: لا يوجد نشاط في هذه الفترة

source: Completed
ar: مكتمل

# progressAndNotes
source: Progress & Notes
ar: السجل والملاحظات

source: Notes History
ar: سجل الملاحظات

source: Close
ar: إغلاق

source: No notes recorded yet
ar: لم يتم تسجيل أي ملاحظات بعد

# noAyahFound
source: No ayah found matching criteria
ar: لم يتم العثور على آية مطابقة

source: Did you get it right?
ar: هل أجبت بشكل صحيح؟

source: Yes
ar: نعم

source: No
ar: لا

# questionAnsweredError
source: No questions answered yet!
ar: لم يتم الإجابة على أي سؤال!

source: Finish Quiz
ar: إنهاء الاختبار

source: Question
ar: السؤال

# completeVersePrompt
source: Complete the Verse
ar: أكمل قوله تعالى

source: Show Answer
ar: إظهار الإجابة

source: Next Question
ar: السؤال التالي

source: Quiz Results
ar: نتائج الاختبار

source: Score
ar: النتيجة

source: Correct
ar: صحيح

source: Wrong
ar: خطأ

source: Detailed Review
ar: مراجعة تفصيلية

# questionsCount
source: {count} Questions
ar: {count} أسئلة

source: Home
ar: الرئيسية

source: Ayah
ar: آية

source: Select Surahs
ar: اختر السور

source: Search Surah...
ar: ابحث عن سورة...

source: Confirm
ar: تأكيد

# selectTypeMessage
source: Please select Type 'Page Range' or 'Surah Selection'
ar: يرجى اختيار النوع 'نطاق الصفحات' أو 'اختيار السور'

# selectSurahMessage
source: Please select at least one Surah
ar: يرجى اختيار سورة واحدة على الأقل

# enterPagesMessage
source: Please enter both start and end pages
ar: يرجى إدخال صفحتي البداية والنهاية

source: Invalid number format
ar: صيغة الرقم غير صحيحة

# invalidPageRange
source: Invalid page range (1-604)
ar: نطاق الصفحات غير صحيح (1-604)

# pageRangeTitle
source: Page Range
ar: نطاق الصفحات

# fromPageLabel
source: From Page
ar: من صفحة

# toPageLabel
source: To Page
ar: إلى صفحة

# surahSelectionTitle
source: Surah Selection
ar: اختيار السور

# selectSurahsButton
source: Select Surahs
ar: اختر السور

# startQuizButton
source: Start Quiz
ar: بدء الاختبار

# backupToFile
source: Backup to a file
ar: النسخ الاحتياطي إلى ملف

# backupFailed
source: Backup failed: {error}
ar: فشل النسخ الاحتياطي: {error}

# restoreFromFile
source: Restore from a file
ar: استعادة من ملف

# restoreFailed
source: Restore failed: {error}
ar: فشل الاستعادة: {error}

# clearAllData
source: Clear all tasks and progress
ar: مسح جميع المهام والتقدم

source: General Note
ar: ملاحظة عامة

source: Completed On
ar: أكملت في

source: Task Type
ar: نوع المهمة
